# OrdinateDimensionSetting Class

---
Represents a collection of Ordinate Dimension settings that can be associated to an ordinate DimensionType.
SystemObject Autodesk.Revit.DBOrdinateDimensionSetting
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class OrdinateDimensionSetting : IDisposable

    Public Class OrdinateDimensionSetting
    	Implements IDisposable

    public ref class OrdinateDimensionSetting : IDisposable

    type OrdinateDimensionSetting =
        class
            interface IDisposable
        end
The OrdinateDimensionSetting type exposes the following members.
| Name| Description
---|---|---
| OrdinateDimensionSetting|  Constructs a new OrdinateDimensionSetting object with default settings.
Top
| Name| Description
---|---|---
| DimensionLineLength|  Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented.
| DimensionLineStyle|  Specifies the dimension line style.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginTickMarkId|  Specifies the id of the tick mark element to use for the dimension origin.
| OriginVisibility|  Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string).
| TextOrientation|  Specifies where to align the dimension text.
| TextPosition|  Specifies the dimension text position.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the OrdinateDimensionSetting
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace